Autodesk.Revit.DB.LinePattern.SetSegments(System.Collections.Generic.IList`1{Autodesk.Revit.DB.LinePatternSegment})
Sets the sequence of segments that defines this line pattern.
lineSegs:
The sequence of segments.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL